* Get Customers with Services
:PROPERTIES:
:header-args: sql :engine postgresql :dbuser nico :database billing
:END:
Write a query to retrieve the customer data for every customer who currently subscribes to at least one service.

#+BEGIN_SRC sql
  SELECT c.id, c.name, c.payment_token

    FROM customers AS c
           INNER JOIN customers_services AS cs
               ON c.id = cs.customer_id
           INNER JOIN services AS s
           ON cs.service_id = s.id
  GROUP BY c.id;


#+END_SRC

#+RESULTS:
| id | name        | payment_token |
|----+-------------+---------------|
|  4 | Lynnn Blake | KLZXWEEE      |
|  6 | Scott Lakso | UUEAPQPS      |
|  2 | Pat Johnson | XHGOAHEQ      |
|  5 | Chen Ke-Hua | KWETYCVX      |
|  7 | Jim Pornot  | XKJEYAZA      |
